#include <iostream>
using namespace std;
int main()
{
	int a, b;
	setlocale(LC_ALL, "Russian");
	cout << "Введите  день и месяц ";
	cin >> a >> b;
	if (b==1 && a > 0 && a < 32){cout << "Дата введена верно ";}
	if (b == 2 && a > 0 && a < 30){cout << "Дата введена верно ";}
	if (b == 3 && a > 0 && a < 32){cout << "Дата введена верно ";}
	if (b == 4 && a > 0 && a < 31){cout << "Дата введена верно ";}
	if (b == 5 && a > 0 && a < 32){cout << "Дата введена верно ";}
	if (b == 6 && a > 0 && a < 31) { cout << "Дата введена верно "; }
	if (b == 7 && a > 0 && a < 32) { cout << "Дата введена верно "; }
	if (b == 8 && a > 0 && a < 32) { cout << "Дата введена верно "; }
	if (b == 9 && a > 0 && a < 31) { cout << "Дата введена верно "; }
	if (b == 10 && a > 0 && a < 32) { cout << "Дата введена верно "; }
	if (b == 11 && a > 0 && a < 31) { cout << "Дата введена верно "; }
	if (b == 12 && a > 0 && a < 32) { cout << "Дата введена верно "; }
	if(b<1||b>12||a<1||a>31) { cout << "Дата введена неверно "; }
	return 0;
}