/* figure: task9 */
/*****************************************************************/
/* Filename: task9.cpp */
/* Abstract: Это простая с++ программа */
/* Description: Считает значение переменных y и z  */
/* Create Date: 2019 / 09 / 22 */
/* Author:Сухоруков Валерий Алексеевич */
/*****************************************************************/
char logo[] = "*********************************************************\n"

"* Nizhniy Novgorod Technical University *\n"

"* Study work number 1. Task number 9. *\n"

"* Performed student 19-IVT-3 Sukhorukov V.A. *\n"

"*********************************************************\n";
#include <iostream>/* подключение библиотеки ввода/вывода*/
#include <cmath>/* подключение библиотеки математических операций*/
using namespace std;/* использование пространства имен std*/
int main()/*Работа программы начинается с вызова функции main() */
{	/* BEGIN: Начало кода главной функции модуля */
	cout << logo;/*вывод логотипа*/
	float x=0.12, y, z, a = 0.01;/*определение переменных*/
	y = sqrt(x*x+a);/*подсчет у*/
	z = asin(x*x*x-a);/*подсчет z */
	cout<<"for x=0.12 , a =0.01 y = " << y<<" z = " << z;/*выводит сообщение на экран*/
	return 0;/* Возврат управления ОС в случае успешной работы */
}/* END: Конец кода главной функции модуля */